'''6. Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и
возвращающую их же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
'''

import re

def int_func():
    '''description'''
    new_str = take_input()
    return new_str.title()



def take_input():
    '''description'''

